In [1]:
import pandas as pd
dogs=pd.read_excel(r'D:\My Goals 2021\1. DeepBytes\1A. Python\3. Pandas\pandtable.xlsx')
print(dogs)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
4      Max     Labrador  Black          59           29    2013-07-05
5    Stell     Chihuhua    Tan          18            2    2013-07-06
6   Bernie  St. Bernard  White          77           74    2013-07-07

                     Exploring a DataFrame: .head()

In [2]:
dogs.head()

     Name       Breed  Color  Height(cm)  Weight (kg) Date of Birth
0    Bella   Labrador  Brown          56           25    2013-07-01
1  Charlie     Poodle  Black          43           23    2013-07-02
2     Lucy  Chow Chow  Brown          46           22    2013-07-03
3   Cooper  Schnauzer   Gray          49           17    2013-07-04
4      Max   Labrador  Black          59           29    2013-07-05

                  Exploring a DataFrame: .info()

In [3]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height(cm)     7 non-null      int64
 4   Weight (kg)    7 non-null      int64
 5   Date of Birth  7 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 464.0+ bytes

                 Exploring a DataFrame: .shape

In [4]:
dogs.shape

(7, 6)

                Components of a DataFrame: .values

In [5]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56, 25,
        Timestamp('2013-07-01 00:00:00')],
       ['Charlie', 'Poodle', 'Black', 43, 23,
        Timestamp('2013-07-02 00:00:00')],
       ['Lucy', 'Chow Chow', 'Brown', 46, 22,
        Timestamp('2013-07-03 00:00:00')],
       ['Cooper', 'Schnauzer', 'Gray', 49, 17,
        Timestamp('2013-07-04 00:00:00')],
       ['Max', 'Labrador', 'Black', 59, 29,
        Timestamp('2013-07-05 00:00:00')],
       ['Stell', 'Chihuhua', 'Tan', 18, 2,
        Timestamp('2013-07-06 00:00:00')],
       ['Bernie', 'St. Bernard', 'White', 77, 74,
        Timestamp('2013-07-07 00:00:00')]], dtype=object)

Components of a DataFrame: .columns and .index

In [6]:
dogs.columns

Index(['Name ', 'Breed', 'Color', 'Height(cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')

In [7]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

                        pandas Philosophy
There should be one -- and preferably only one -- obvious way to do it.
- The Zen of Python by Tim Peters, Item 13

                                     Sorting and subsetting

In [8]:
dogs.sort_values("Weight (kg)")

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
5    Stell     Chihuhua    Tan          18            2    2013-07-06
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
1  Charlie       Poodle  Black          43           23    2013-07-02
0    Bella     Labrador  Brown          56           25    2013-07-01
4      Max     Labrador  Black          59           29    2013-07-05
6   Bernie  St. Bernard  White          77           74    2013-07-07

Sorting in descending order

In [10]:
dogs.sort_values("Weight (kg)", ascending=False)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
6   Bernie  St. Bernard  White          77           74    2013-07-07
4      Max     Labrador  Black          59           29    2013-07-05
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
5    Stell     Chihuhua    Tan          18            2    2013-07-06

In [12]:
dogs.sort_values(["Weight (kg)", "Height(cm)"])

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
5    Stell     Chihuhua    Tan          18            2    2013-07-06
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
1  Charlie       Poodle  Black          43           23    2013-07-02
0    Bella     Labrador  Brown          56           25    2013-07-01
4      Max     Labrador  Black          59           29    2013-07-05
6   Bernie  St. Bernard  White          77           74    2013-07-07

                Sorting by multiple variables

In [13]:
dogs.sort_values(["Weight (kg)", "Height(cm)"], ascending=[True, False])

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
5    Stell     Chihuhua    Tan          18            2    2013-07-06
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
1  Charlie       Poodle  Black          43           23    2013-07-02
0    Bella     Labrador  Brown          56           25    2013-07-01
4      Max     Labrador  Black          59           29    2013-07-05
6   Bernie  St. Bernard  White          77           74    2013-07-07

Subsetting columns

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
5    Stell     Chihuhua    Tan          18            2    2013-07-06
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
1  Charlie       Poodle  Black          43           23    2013-07-02
0    Bella     Labrador  Brown          56           25    2013-07-01
4      Max     Labrador  Black          59           29    2013-07-05
6   Bernie  St. Bernard  White          77           74    2013-07-07

In [22]:
dogs=pd.read_excel(r'D:\My Goals 2021\1. DeepBytes\1A. Python\3. Pandas\pandtable.xlsx')

In [27]:
dogs[["Breed", "Height(cm)"]]

         Breed  Height(cm)
0     Labrador          56
1       Poodle          43
2    Chow Chow          46
3    Schnauzer          49
4     Labrador          59
5     Chihuhua          18
6  St. Bernard          77

In [28]:
dogs[["Breed",]]

         Breed
0     Labrador
1       Poodle
2    Chow Chow
3    Schnauzer
4     Labrador
5     Chihuhua
6  St. Bernard

                                     Subsetting rows

In [32]:
dogs["Height(cm)"] > 50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: Height(cm), dtype: bool

In [34]:
dogs[dogs["Height(cm)"] > 50]

    Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
0   Bella     Labrador  Brown          56           25    2013-07-01
4     Max     Labrador  Black          59           29    2013-07-05
6  Bernie  St. Bernard  White          77           74    2013-07-07

                      Subsetting based on text data

In [36]:
dogs[dogs["Breed"] == "Labrador"]

   Name      Breed  Color  Height(cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown          56           25    2013-07-01
4    Max  Labrador  Black          59           29    2013-07-05

                                  Subsetting based on dates

In [38]:
dogs[dogs["Date of Birth"] == "2013-07-01"]

   Name      Breed  Color  Height(cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown          56           25    2013-07-01

                   Subsetting based on multiple conditions

In [39]:
is_lab = dogs["Breed"] == "Labrador"
is_brown = dogs["Color"] == "Brown"
dogs[is_lab & is_brown]

   Name      Breed  Color  Height(cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown          56           25    2013-07-01

                           Subsetting using .isin()

In [40]:
 is_black_or_brown = dogs["Color"].isin(["Black", "Brown"])
 dogs[is_black_or_brown]

     Name       Breed  Color  Height(cm)  Weight (kg) Date of Birth
0    Bella   Labrador  Brown          56           25    2013-07-01
1  Charlie     Poodle  Black          43           23    2013-07-02
2     Lucy  Chow Chow  Brown          46           22    2013-07-03
4      Max   Labrador  Black          59           29    2013-07-05

                              Adding a new column

In [42]:
dogs["height_m"] = dogs["Height(cm)"] / 100
print(dogs)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth  \
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
4      Max     Labrador  Black          59           29    2013-07-05
5    Stell     Chihuhua    Tan          18            2    2013-07-06
6   Bernie  St. Bernard  White          77           74    2013-07-07

   height_m
0      0.56
1      0.43
2      0.46
3      0.49
4      0.59
5      0.18
6      0.77

Doggy mass index

In [45]:
dogs["bmi"] = dogs["Weight (kg)"] / dogs["height_m"] ** 2
print(dogs.head())

     Name       Breed  Color  Height(cm)  Weight (kg) Date of Birth  height_m  \
0    Bella   Labrador  Brown          56           25    2013-07-01      0.56
1  Charlie     Poodle  Black          43           23    2013-07-02      0.43
2     Lucy  Chow Chow  Brown          46           22    2013-07-03      0.46
3   Cooper  Schnauzer   Gray          49           17    2013-07-04      0.49
4      Max   Labrador  Black          59           29    2013-07-05      0.59

          bmi
0   79.719388
1  124.391563
2  103.969754
3   70.803832
4   83.309394

Multiple manipulations

In [54]:
bmi_lt_100 = dogs[dogs["bmi"] < 100]
bmi_lt_100_height = bmi_lt_100.sort_values("Height(cm)", ascending=False)
bmi_lt_100_height[["Name " ,"Height(cm)", "bmi"]] # Here you have to put a tab after name

    Name   Height(cm)        bmi
4     Max          59  83.309394
0   Bella          56  79.719388
3  Cooper          49  70.803832
5   Stell          18  61.728395

                          Summary statistics

Summarizing numerical data

In [55]:
dogs["Height(cm)"].mean()

49.714285714285715

.median() , .mode()
.min() , .max()
.var() , .std()
.sum()
.quantile()

Summarizing dates

In [58]:
dogs["Date of Birth"].min()

Timestamp('2013-07-01 00:00:00')

In [59]:
dogs["Date of Birth"].max()

Timestamp('2013-07-07 00:00:00')

                                The .agg() method

In [60]:
def pct30(column):
    return column.quantile(0.3)

In [63]:
dogs["Weight (kg)"].agg(pct30)

20.999999999999996

                                   Cumulative sum

In [65]:
dogs["Weight (kg)"]

0    25
1    23
2    22
3    17
4    29
5     2
6    74
Name: Weight (kg), dtype: int64

In [66]:
dogs["Weight (kg)"].cumsum()

0     25
1     48
2     70
3     87
4    116
5    118
6    192
Name: Weight (kg), dtype: int64

                        Cumulative statistics
.cummax()
.cummin()
.cumprod(

In [67]:
sales=pd.read_excel(r'D:\My Goals 2021\1. DeepBytes\1A. Python\3. Pandas\wal.xlsx')

In [68]:
sales.head()

,Unnamed: 0,store,type,dept,date,weekly_sales,is_holiday,temp_c,fuel_price,unemp
0,0,1,A,1,2010-02-05,24924.50,False,5.73,0.679,8.106
1,1,1,A,2,2010-02-05,50605.27,False,5.73,0.679,8.106
2,2,1,A,3,2010-02-05,13740.12,False,5.73,0.679,8.106
3,3,1,A,4,2010-02-05,39954.04,False,5.73,0.679,8.106
4,4,1,A,5,2010-02-05,32229.38,False,5.73,0.679,8.106

                                      Counting

Avoiding double counting

In [72]:
vet_visits=pd.read_excel(r'D:\My Goals 2021\1. DeepBytes\1A. Python\3. Pandas\vet_visits.xlsx')
print(vet_visits)

        date   name       breed  weight_kg
0 2018-09-02   Bella   Labrador      24.87
1 2019-06-07     Max   Labrador      28.35
2 2018-01-17  Stella  Chihuahua       1.51
3 2019-10-19    Lucy  Chow Chow      24.07
4 2018-09-02   Bella  Chihuahua       2.83
5 2019-06-07     Max  Chow Chow      24.01
6 2018-01-17  Stella  Chow Chow      24.40
7 2019-10-19    Lucy   Labrador      28.54

                    Dropping duplicate names

In [75]:
vet_visits.drop_duplicates(subset="name ") #one space tab after

        date   name       breed  weight_kg
0 2018-09-02   Bella   Labrador      24.87
1 2019-06-07     Max   Labrador      28.35
2 2018-01-17  Stella  Chihuahua       1.51
3 2019-10-19    Lucy  Chow Chow      24.07

                         Dropping duplicate pairs

In [77]:
unique_dogs = vet_visits.drop_duplicates(subset=["name ", "breed"])

In [78]:
print(unique_dogs)

        date   name       breed  weight_kg
0 2018-09-02   Bella   Labrador      24.87
1 2019-06-07     Max   Labrador      28.35
2 2018-01-17  Stella  Chihuahua       1.51
3 2019-10-19    Lucy  Chow Chow      24.07
4 2018-09-02   Bella  Chihuahua       2.83
5 2019-06-07     Max  Chow Chow      24.01
6 2018-01-17  Stella  Chow Chow      24.40
7 2019-10-19    Lucy   Labrador      28.54

Easy as 1, 2, 3

In [79]:
unique_dogs["breed"].value_counts()

Chow Chow    3
Labrador     3
Chihuahua    2
Name: breed, dtype: int64

In [80]:
unique_dogs["breed"].value_counts(sort=True)

Chow Chow    3
Labrador     3
Chihuahua    2
Name: breed, dtype: int64

                                      Proportions

In [81]:
unique_dogs["breed"].value_counts(normalize=True)

Chow Chow    0.375
Labrador     0.375
Chihuahua    0.250
Name: breed, dtype: float64

Grouped summary statistics

In [83]:
dogs[dogs["Color"] == "Black"]["Weight (kg)"].mean()

26.0

In [86]:
dogs[dogs["Color"] == "Brown"]["Weight (kg)"].mean()
dogs[dogs["Color"] == "White"]["Weight (kg)"].mean()
dogs[dogs["Color"] == "Gray"]["Weight (kg)"].mean()
dogs[dogs["Color"] == "Tan"]["Weight (kg)"].mean()

2.0

                            Grouped summaries

In [88]:
dogs.groupby("Color")["Weight (kg)"].mean()

Color
Black    26.0
Brown    23.5
Gray     17.0
Tan       2.0
White    74.0
Name: Weight (kg), dtype: float64

Multiple grouped summaries

In [89]:
dogs.groupby("Color")["Weight (kg)"].agg([min, max, sum])

       min  max  sum
Color
Black   23   29   52
Brown   22   25   47
Gray    17   17   17
Tan      2    2    2
White   74   74   74

Grouping by multiple variables

In [91]:
dogs.groupby(["Color", "Breed"])["Weight (kg)"].mean()

Color  Breed
Black  Labrador       29
       Poodle         23
Brown  Chow Chow      22
       Labrador       25
Gray   Schnauzer      17
Tan    Chihuhua        2
White  St. Bernard    74
Name: Weight (kg), dtype: int64

                        Many groups, many summaries

In [93]:
dogs.groupby(["Color", "Breed"])[["Weight (kg)", "Height(cm)"]].mean()

                   Weight (kg)  Height(cm)
Color Breed
Black Labrador              29          59
      Poodle                23          43
Brown Chow Chow             22          46
      Labrador              25          56
Gray  Schnauzer             17          49
Tan   Chihuhua               2          18
White St. Bernard           74          77

                                Pivot tables

Group by to pivot table

In [94]:
dogs.groupby("Color")["Weight (kg)"].mean()

Color
Black    26.0
Brown    23.5
Gray     17.0
Tan       2.0
White    74.0
Name: Weight (kg), dtype: float64

In [95]:
dogs.pivot_table(values="Weight (kg)",
index="Color")

       Weight (kg)
Color
Black         26.0
Brown         23.5
Gray          17.0
Tan            2.0
White         74.0

In [96]:
import numpy as np
dogs.pivot_table(values="Weight (kg)", index="Color", aggfunc=np.median)

       Weight (kg)
Color
Black         26.0
Brown         23.5
Gray          17.0
Tan            2.0
White         74.0

Multiple statistic

In [97]:
dogs.pivot_table(values="Weight (kg)", index="Color", aggfunc=[np.mean, np.median])

             mean      median
      Weight (kg) Weight (kg)
Color
Black        26.0        26.0
Brown        23.5        23.5
Gray         17.0        17.0
Tan           2.0         2.0
White        74.0        74.0

                         Pivot on two variables

In [98]:
dogs.groupby(["Color", "Breed"])["Weight (kg)"].mean()

Color  Breed
Black  Labrador       29
       Poodle         23
Brown  Chow Chow      22
       Labrador       25
Gray   Schnauzer      17
Tan    Chihuhua        2
White  St. Bernard    74
Name: Weight (kg), dtype: int64

Filling missing values in pivot tables

In [99]:
dogs.pivot_table(values="Weight (kg)", index="Color", columns="Breed", fill_value=0)

Breed  Chihuhua  Chow Chow  Labrador  Poodle  Schnauzer  St. Bernard
Color
Black         0          0        29      23          0            0
Brown         0         22        25       0          0            0
Gray          0          0         0       0         17            0
Tan           2          0         0       0          0            0
White         0          0         0       0          0           74

Summing with pivot tables

In [100]:
dogs.pivot_table(values="Weight (kg)", index="Color", columns="Breed",
fill_value=0, margins=True)

Breed  Chihuhua  Chow Chow  Labrador  Poodle  Schnauzer  St. Bernard   All
Color
Black         0          0        29      23          0            0  26.0
Brown         0         22        25       0          0            0  23.5
Gray          0          0         0       0         17            0  17.0
Tan           2          0         0       0          0            0   2.0
White         0          0         0       0          0           74  74.0
All           2         22        27      23         17           74  27.0

                           Explicit indexes

In [101]:
print(dogs)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth  \
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
4      Max     Labrador  Black          59           29    2013-07-05
5    Stell     Chihuhua    Tan          18            2    2013-07-06
6   Bernie  St. Bernard  White          77           74    2013-07-07

   height_m         bmi
0      0.56   79.719388
1      0.43  124.391563
2      0.46  103.969754
3      0.49   70.803832
4      0.59   83.309394
5      0.18   61.728395
6      0.77  124.810255

In [102]:
dogs.columns

Index(['Name ', 'Breed', 'Color', 'Height(cm)', 'Weight (kg)', 'Date of Birth',
       'height_m', 'bmi'],
      dtype='object')

In [103]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

Setting a column as the index

In [105]:
dogs_ind = dogs.set_index("Name ")
print(dogs_ind)

               Breed  Color  Height(cm)  Weight (kg) Date of Birth  height_m  \
Name
Bella       Labrador  Brown          56           25    2013-07-01      0.56
Charlie       Poodle  Black          43           23    2013-07-02      0.43
Lucy       Chow Chow  Brown          46           22    2013-07-03      0.46
Cooper     Schnauzer   Gray          49           17    2013-07-04      0.49
Max         Labrador  Black          59           29    2013-07-05      0.59
Stell       Chihuhua    Tan          18            2    2013-07-06      0.18
Bernie   St. Bernard  White          77           74    2013-07-07      0.77

                bmi
Name
Bella     79.719388
Charlie  124.391563
Lucy     103.969754
Cooper    70.803832
Max       83.309394
Stell     61.728395
Bernie   124.810255

In [106]:
dogs_ind.reset_index()

,Name,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
0,Bella,Labrador,Brown,56,25,2013-07-01,0.56,79.719388
1,Charlie,Poodle,Black,43,23,2013-07-02,0.43,124.391563
2,Lucy,Chow Chow,Brown,46,22,2013-07-03,0.46,103.969754
3,Cooper,Schnauzer,Gray,49,17,2013-07-04,0.49,70.803832
4,Max,Labrador,Black,59,29,2013-07-05,0.59,83.309394
5,Stell,Chihuhua,Tan,18,2,2013-07-06,0.18,61.728395
6,Bernie,St. Bernard,White,77,74,2013-07-07,0.77,124.810255

Dropping an index

In [107]:
dogs_ind.reset_index(drop=True)

,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
0,Labrador,Brown,56,25,2013-07-01,0.56,79.719388
1,Poodle,Black,43,23,2013-07-02,0.43,124.391563
2,Chow Chow,Brown,46,22,2013-07-03,0.46,103.969754
3,Schnauzer,Gray,49,17,2013-07-04,0.49,70.803832
4,Labrador,Black,59,29,2013-07-05,0.59,83.309394
5,Chihuhua,Tan,18,2,2013-07-06,0.18,61.728395
6,St. Bernard,White,77,74,2013-07-07,0.77,124.810255

Indexes make subsetting simpler

In [108]:
dogs[dogs["Name "].isin(["Bella", "Stella"])]

,Name,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
0,Bella,Labrador,Brown,56,25,2013-07-01,0.56,79.719388

In [110]:
dogs_ind.loc[["Bella"]]

,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
Name,,,,,,,
Bella,Labrador,Brown,56,25,2013-07-01,0.56,79.719388

                    Explicit indexes

In [111]:
print(dogs)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth  \
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
4      Max     Labrador  Black          59           29    2013-07-05
5    Stell     Chihuhua    Tan          18            2    2013-07-06
6   Bernie  St. Bernard  White          77           74    2013-07-07

   height_m         bmi
0      0.56   79.719388
1      0.43  124.391563
2      0.46  103.969754
3      0.49   70.803832
4      0.59   83.309394
5      0.18   61.728395
6      0.77  124.810255

In [112]:
dogs.columns

Index(['Name ', 'Breed', 'Color', 'Height(cm)', 'Weight (kg)', 'Date of Birth',
       'height_m', 'bmi'],
      dtype='object')

In [113]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

Setting a column as the index

In [116]:
dogs_ind = dogs.set_index("Name ")
print(dogs_ind)

               Breed  Color  Height(cm)  Weight (kg) Date of Birth  height_m  \
Name
Bella       Labrador  Brown          56           25    2013-07-01      0.56
Charlie       Poodle  Black          43           23    2013-07-02      0.43
Lucy       Chow Chow  Brown          46           22    2013-07-03      0.46
Cooper     Schnauzer   Gray          49           17    2013-07-04      0.49
Max         Labrador  Black          59           29    2013-07-05      0.59
Stell       Chihuhua    Tan          18            2    2013-07-06      0.18
Bernie   St. Bernard  White          77           74    2013-07-07      0.77

                bmi
Name
Bella     79.719388
Charlie  124.391563
Lucy     103.969754
Cooper    70.803832
Max       83.309394
Stell     61.728395
Bernie   124.810255

Removing an index

In [117]:
dogs_ind.reset_index()

,Name,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
0,Bella,Labrador,Brown,56,25,2013-07-01,0.56,79.719388
1,Charlie,Poodle,Black,43,23,2013-07-02,0.43,124.391563
2,Lucy,Chow Chow,Brown,46,22,2013-07-03,0.46,103.969754
3,Cooper,Schnauzer,Gray,49,17,2013-07-04,0.49,70.803832
4,Max,Labrador,Black,59,29,2013-07-05,0.59,83.309394
5,Stell,Chihuhua,Tan,18,2,2013-07-06,0.18,61.728395
6,Bernie,St. Bernard,White,77,74,2013-07-07,0.77,124.810255

Dropping an index

In [118]:
dogs_ind.reset_index(drop=True)

,Breed,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
0,Labrador,Brown,56,25,2013-07-01,0.56,79.719388
1,Poodle,Black,43,23,2013-07-02,0.43,124.391563
2,Chow Chow,Brown,46,22,2013-07-03,0.46,103.969754
3,Schnauzer,Gray,49,17,2013-07-04,0.49,70.803832
4,Labrador,Black,59,29,2013-07-05,0.59,83.309394
5,Chihuhua,Tan,18,2,2013-07-06,0.18,61.728395
6,St. Bernard,White,77,74,2013-07-07,0.77,124.810255

In [120]:
dogs_ind2 = dogs.set_index("Breed")
print(dogs_ind2)

               Name   Color  Height(cm)  Weight (kg) Date of Birth  height_m  \
Breed
Labrador       Bella  Brown          56           25    2013-07-01      0.56
Poodle       Charlie  Black          43           23    2013-07-02      0.43
Chow Chow       Lucy  Brown          46           22    2013-07-03      0.46
Schnauzer     Cooper   Gray          49           17    2013-07-04      0.49
Labrador         Max  Black          59           29    2013-07-05      0.59
Chihuhua       Stell    Tan          18            2    2013-07-06      0.18
St. Bernard   Bernie  White          77           74    2013-07-07      0.77

                    bmi
Breed
Labrador      79.719388
Poodle       124.391563
Chow Chow    103.969754
Schnauzer     70.803832
Labrador      83.309394
Chihuhua      61.728395
St. Bernard  124.810255

                               Subsetting on duplicated index values

In [121]:
dogs_ind2.loc["Labrador"]

,Name,Color,Height(cm),Weight (kg),Date of Birth,height_m,bmi
Breed,,,,,,,
Labrador,Bella,Brown,56,25,2013-07-01,0.56,79.719388
Labrador,Max,Black,59,29,2013-07-05,0.59,83.309394

                           Multi-level indexes a.k.a. hierarchical indexes

In [17]:
import pandas as pd
dogs=pd.read_excel(r'D:\My Goals 2021\1. DeepBytes\1A. Python\3. Pandas\pandtable.xlsx')
print(dogs)

     Name         Breed  Color  Height(cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown          56           25    2013-07-01
1  Charlie       Poodle  Black          43           23    2013-07-02
2     Lucy    Chow Chow  Brown          46           22    2013-07-03
3   Cooper    Schnauzer   Gray          49           17    2013-07-04
4      Max     Labrador  Black          59           29    2013-07-05
5    Stell     Chihuhua    Tan          18            2    2013-07-06
6   Bernie  St. Bernard  White          77           74    2013-07-07

In [20]:
dogs_ind3 = dogs.set_index(["Breed", "Color"])
print(dogs_ind3)

                     Name   Height(cm)  Weight (kg) Date of Birth
Breed       Color
Labrador    Brown    Bella          56           25    2013-07-01
Poodle      Black  Charlie          43           23    2013-07-02
Chow Chow   Brown     Lucy          46           22    2013-07-03
Schnauzer   Gray    Cooper          49           17    2013-07-04
Labrador    Black      Max          59           29    2013-07-05
Chihuhua    Tan      Stell          18            2    2013-07-06
St. Bernard White   Bernie          77           74    2013-07-07

In [21]:
dogs_ind3.loc[["Labrador", "Chihuhua"]]

                Name   Height(cm)  Weight (kg) Date of Birth
Breed    Color
Labrador Brown  Bella          56           25    2013-07-01
         Black    Max          59           29    2013-07-05
Chihuhua Tan    Stell          18            2    2013-07-06

In [22]:
dogs_ind3.loc[[("Labrador", "Brown"), ("Chihuhua", "Tan")]]

                Name   Height(cm)  Weight (kg) Date of Birth
Breed    Color
Labrador Brown  Bella          56           25    2013-07-01
Chihuhua Tan    Stell          18            2    2013-07-06

In [23]:
dogs_ind3.sort_index()

                     Name   Height(cm)  Weight (kg) Date of Birth
Breed       Color
Chihuhua    Tan      Stell          18            2    2013-07-06
Chow Chow   Brown     Lucy          46           22    2013-07-03
Labrador    Black      Max          59           29    2013-07-05
            Brown    Bella          56           25    2013-07-01
Poodle      Black  Charlie          43           23    2013-07-02
Schnauzer   Gray    Cooper          49           17    2013-07-04
St. Bernard White   Bernie          77           74    2013-07-07

In [24]:
dogs_ind3.sort_index(level=["Color", "Breed"], ascending=[True, False])

                     Name   Height(cm)  Weight (kg) Date of Birth
Breed       Color
Poodle      Black  Charlie          43           23    2013-07-02
Labrador    Black      Max          59           29    2013-07-05
            Brown    Bella          56           25    2013-07-01
Chow Chow   Brown     Lucy          46           22    2013-07-03
Schnauzer   Gray    Cooper          49           17    2013-07-04
Chihuhua    Tan      Stell          18            2    2013-07-06
St. Bernard White   Bernie          77           74    2013-07-07

In [25]:
Breeds = ["Labrador", "Poodle",
"Chow Chow", "Schnauzer",
"Labrador", "Chihuahua",
"St. Bernard"]

In [26]:
Breeds[2:5]

NameError: name 'Breeds' is not defined